kaini-industries/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
// ---------------- sinks used by the engine ----------------

void haWsSendWs(uint32_t wsId, const String& msg) {
    if(!wsId) return;
    ws.text(wsId, msg);
}
void haWsCloseWs(uint32_t wsId) {
    if(wsId) ws.close(wsId, 1008, "identity takeover");
}
void haWsBroadcast(const String& msg) {
    ws.textAll(msg);
}
static bool identityKnown(const char* identity) {
    if(!identity || strlen(identity) != HA_IDENTITY_LEN) return false;
    for(uint8_t i = 0; i < knownIdentityCount; i++)
        if(strcmp(knownIdentities[i], identity) == 0) return true;
    return false;
}
static void rememberIdentity(const char* identity) {
    if(identityKnown(identity) || knownIdentityCount >= 32) return;
    strlcpy(knownIdentities[knownIdentityCount++], identity, sizeof(knownIdentities[0]));
}
static void clearKnownIdentities() {
    memset(knownIdentities, 0, sizeof(knownIdentities));
    knownIdentityCount = 0;
}
uint8_t haAuthorizeIdentity(
    uint32_t wsId, const char* identity, const char* code, uint32_t* retryMs) {
    (void)wsId;
    if(retryMs) *retryMs = 0;
    if(identityKnown(identity)) return HA_JOIN_AUTH_KNOWN;
    if(!joinCode[0]) return HA_JOIN_AUTH_OK; // legacy Flipper host: open admission
    if(!code || !code[0]) return HA_JOIN_AUTH_REQUIRED;
    return strcmp(code, joinCode) == 0 ? HA_JOIN_AUTH_OK : HA_JOIN_AUTH_BAD_CODE;
}
void haUartJoin(uint8_t pid, const char* nick) {
    uint8_t buf[1 + HA_NICK_LEN + 1];
    buf[0] = pid;
    size_t n = strlen(nick);
    if(n > HA_NICK_LEN) n = HA_NICK_LEN;
    memcpy(buf + 1, nick, n);
    uartSend(HA_MSG_JOIN, buf, 1 + n);
}
void haUartJoinStable(uint8_t pid, const char* identity, const char* nick, const char* avatar) {
    (void)avatar;
    rememberIdentity(identity);
    // The generic Flipper UI still consumes the legacy pid+nickname payload. The
    // stable digest is deliberately kept in the host adapter; richer hosts (such
    // as Cardputer) implement this sink and persist the digest themselves.
    haUartJoin(pid, nick);
}
void haUartLeave(uint8_t pid) {
    uartSend(HA_MSG_LEAVE, &pid, 1);
}
void haUartScore(uint8_t pid, int delta, const char* reason) {
    uint8_t buf[1 + 2 + 24];
    buf[0] = pid;
    int16_t d = (int16_t)delta;
    buf[1] = (uint8_t)(d & 0xFF);
    buf[2] = (uint8_t)((d >> 8) & 0xFF);
    size_t n = strlen(reason);
    if(n > 24) n = 24;
    memcpy(buf + 3, reason, n);
    uartSend(HA_MSG_SCORE, buf, 3 + n);
}
void haUartEvent(const String& json) {
    uartSend(HA_MSG_EVENT, (const uint8_t*)json.c_str(), json.length());
}
void haUartRoundResult(const String& json) {
    uartSend(HA_MSG_ROUND_RESULT, (const uint8_t*)json.c_str(), json.length());
}
// Finished artwork (Frankendraw). One frame per call -- a sheet header, a single line
// segment, or the end marker -- so a whole drawing streams to the Flipper a segment at
// a time and neither side ever buffers one. Payload is the op byte then the JSON.
void haUartArt(uint8_t op, const String& json) {
    uint8_t buf[192];
    buf[0] = op;
    size_t n = json.length();
    if(n > sizeof(buf) - 1) n = sizeof(buf) - 1;
    memcpy(buf + 1, json.c_str(), n);
    uartSend(HA_MSG_ART, buf, 1 + n);
}

// Debug trace of the engine's identity decisions. Serial is the Flipper link, so a
// log line shares the wire with the framed protocol: safe because the receiver only
// starts a frame on the SYNC byte (0xA5) and resyncs on a bad CRC, and because
// haLog() emits printable ASCII only -- a UTF-8 nickname could otherwise carry a
// literal 0xA5 and be mistaken for the start of a frame. Written under the same
// mutex as a frame, so it can never land inside one.
static void haLog(const String& line) {
    if(serialMutex) xSemaphoreTake(serialMutex, portMAX_DELAY);
    Serial.print("\n[ha] ");
    for(const char* p = line.c_str(); *p; p++)
        Serial.write((*p >= 0x20 && (uint8_t)*p < 0x7F) ? *p : '?');
    Serial.print("\n");
    if(serialMutex) xSemaphoreGive(serialMutex);
}
void haLogJoin(uint8_t pid, uint64_t deviceKey, const char* nick, bool consolidated) {
    String where = deviceKeyText(deviceKey);
    if(consolidated)
        haLog(String("SAME DEVICE ") + where + " -> pid=" + pid + " nick=\"" + nick +
              "\" (consolidated)");
    else
        haLog(String("JOIN pid=") + pid + " " + where + " nick=\"" + nick + "\"");
}

// ---------------- HTTP (captive) ----------------

// Serve the streamed web bundle for every host/path so the captive portal always
// resolves. GET "/" (and every OS captive-probe URL) gets the app; other stored
// asset paths are served by exact match.
class ArcadeHandler : public AsyncWebHandler {
public:
    bool canHandle(AsyncWebServerRequest* request) const override {
        (void)request;
        return true;
    }
    void handleRequest(AsyncWebServerRequest* request) override {
        String url = request->url();
        const Asset* a = assets.find(url.c_str());
        if(!a) a = assets.root(); // captive-detection URLs and "/" -> the app
        // Serve the ~47 KB app to real browsers -- including the iOS captive WINDOW, which is
        // a WebKit view with a "Mozilla" User-Agent, so the app renders there too. The OS
        // captive-detection *probes* (User-Agent "CaptiveNetworkSupport...") fire several at
        // once; serving the bundle from flash to each copies into per-connection TCP buffers
        // and storms the heap, so those get a tiny landing instead.
        bool browser = request->header("User-Agent").indexOf("Mozilla") >= 0;
        // HTTP caching: the bundle CRC is a strong ETag. A client that already holds this exact
        // bundle revalidates with If-None-Match and gets a tiny 304 -- no 47 KB body -- so a
        // reload or an iOS captive re-probe costs nothing instead of re-sending the whole
        // bundle. The ETag changes when the host updates the bundle, so updates are never stale.
        char etag[12] = "";
        if(browser && fsReady && a && a->len) {
            snprintf(etag, sizeof(etag), "\"%08lx\"", (unsigned long)assets.bundleCrc());
            if(request->header("If-None-Match") == etag) {
                AsyncWebServerResponse* nm = request->beginResponse(304);
                nm->addHeader("ETag", etag);
                request->send(nm);
                return;
            }
        }
        File f;
        if(browser && fsReady && a && a->len) f = LittleFS.open(a->fsname, "r");
        if(!f) {
            request->send(200, "text/html",
                          "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                          "<body style='margin:0;background:#0b0b12;color:#eee;text-align:center;"
                          "font:16px system-ui,sans-serif;padding:2.5em 1em'><h2>Hotspot Arcade</h2>"
                          "<p>Open <b>192.168.4.1</b> in your browser to play.</p></body>");
            return;
        }
        // Streamed from flash (no RAM copy). The stored name ends ".gz" while a->path does
        // not, so AsyncFileResponse sets Content-Encoding: gzip for us; mime is explicit.
        AsyncWebServerResponse* res = request->beginResponse(f, String(a->path), (const char*)a->mime);
        res->addHeader("ETag", etag);
        res->addHeader("Cache-Control", "no-cache");
        request->send(res);
    }
};

// ---------------- WebSocket ----------------

