kaini-industries/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
static void rxByte(uint8_t c) {
    switch(rxState) {
    case RX_SYNC:
        if(c == HA_SYNC) rxState = RX_TYPE;
        break;
    case RX_TYPE:
        rxType = c;
        rxCrc = ha_crc8_upd(0, c);
        rxState = RX_LEN0;
        break;
    case RX_LEN0:
        rxLen = c;
        rxCrc = ha_crc8_upd(rxCrc, c);
        rxState = RX_LEN1;
        break;
    case RX_LEN1:
        rxLen |= ((uint16_t)c << 8);
        rxCrc = ha_crc8_upd(rxCrc, c);
        if(rxLen > HA_MAX_PAYLOAD) {
            rxState = RX_SYNC; // bogus length, resync
            break;
        }
        rxIdx = 0;
        rxState = rxLen ? RX_PAYLOAD : RX_CRC;
        break;
    case RX_PAYLOAD:
        rxBuf[rxIdx++] = c;
        rxCrc = ha_crc8_upd(rxCrc, c);
        if(rxIdx >= rxLen) rxState = RX_CRC;
        break;
    case RX_CRC:
        if(c == rxCrc) {
            dispatchFrame(); // sets next state (RX_SYNC or RX_RAW)
        } else {
            rxState = RX_SYNC; // corrupt frame, drop and resync
        }
        break;
    case RX_RAW:
        break; // handled in bulk below
    }
}

static void pumpSerial() {
    while(Serial.available()) {
        if(rxState == RX_RAW) {
            // Bulk asset bytes: drain as many as we still need in one go.
            size_t need = assets.remaining();
            if(need == 0) {
                rxState = RX_SYNC;
                uartStatus("fok");
                continue;
            }
            uint8_t tmp[256];
            size_t want = need < sizeof(tmp) ? need : sizeof(tmp);
            int got = Serial.read(tmp, want);
            if(got > 0) assets.feed(tmp, (size_t)got);
            if(assets.remaining() == 0) {
                rxState = RX_SYNC;
                uartStatus("fok");
            }
        } else {
            rxByte((uint8_t)Serial.read());
        }
    }
}

// ---------------- Arduino entry ----------------

void setup() {
    serialMutex = xSemaphoreCreateMutex();
    engineMutex = xSemaphoreCreateRecursiveMutex();
    WiFi.onEvent(onWiFiEvent, ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED);
    WiFi.onEvent(onWiFiEvent, ARDUINO_EVENT_WIFI_AP_STADISCONNECTED);
    Serial.setRxBufferSize(4096);
    Serial.begin(HA_UART_BAUD);
    delay(100);
    // Mount the bundle store (formats the spiffs-labelled partition as LittleFS on first
    // boot) and load any bundle a previous session persisted. maxOpenFiles is raised
    // because AsyncFileResponse holds a File open per in-flight response.
    fsReady = LittleFS.begin(true, "/littlefs", 16);
    if(fsReady) assets.load();
    engine.reset();
    uartStatus("boot");
}

void loop() {
    if(portalRunning) {
        dnsServer.processNextRequest();
        ws.cleanupClients();
        ENGINE_LOCK();
        engine.tick(millis());
        ENGINE_UNLOCK();
    }
    pumpSerial();

    static uint32_t lastPing = 0;
    uint32_t now = millis();
    if(now - lastPing >= 2000) {
        lastPing = now;
        // Identity beacon: magic + version + the CRC of the web bundle we hold in flash +
        // the current game id. Version flags an outdated board; the CRC lets the Flipper skip
        // re-streaming an unchanged bundle; the game id lets it mirror phone-vote game changes
        // reliably. Bytes 6-10 are new in v19; bytes 11-14 (free heap KB, free PSRAM KB, LE
        // uint16 each) are new in v1.7.1 for the Flipper's memory readout. Older Flippers read
        // only the bytes they know and ignore the rest, so growing this stays compatible.
        uint32_t bcrc = fsReady ? assets.bundleCrc() : 0;
        uint16_t heapKb = (uint16_t)(ESP.getFreeHeap() / 1024);
        uint16_t psramKb = (uint16_t)(ESP.getFreePsram() / 1024);
        uint8_t beacon[15] = {
            HA_FW_MAGIC_0,
            HA_FW_MAGIC_1,
            HA_FW_MAGIC_2,
            HA_FW_MAGIC_3,
            (uint8_t)(HA_FW_VERSION & 0xFF),
            (uint8_t)(HA_FW_VERSION >> 8),
            (uint8_t)(bcrc & 0xFF),
            (uint8_t)((bcrc >> 8) & 0xFF),
            (uint8_t)((bcrc >> 16) & 0xFF),
            (uint8_t)((bcrc >> 24) & 0xFF),
            engine.activeGame(),
            (uint8_t)(heapKb & 0xFF),
            (uint8_t)(heapKb >> 8),
            (uint8_t)(psramKb & 0xFF),
            (uint8_t)(psramKb >> 8)};
        uartSend(HA_MSG_PING, beacon, sizeof(beacon));
    }
}
